// Ctrl + K + C - закоментувати рядки
// Ctrl + K + U - розкоментувати рядки

// ============================ Theory
// Масиви це колекція елементів - контейнер
// краще використовувати const

const array = [1, 2, 3, 5, 20, 42]; // класичний спосіб створення масиву
// const arrayStrings = ['a', 'b', 'c', null, 12];
// const array = new Array(1, 2, 3, 5, 20, 42); // другий спосіб створення масиву

// сonsole.log(array);
console.log(array.length); // через точку можна дізнаватися властивості
// в Chrome числа number підсвічуються фіолетовим кольором
// в Chrome строчка string підсвічуються бірюзовим кольором
